OpenNuvoton/MS51BSP_IAR/MS51FC0AE_MS51XC0BE_MS51EB0AE_MS51EC0AE_MS51TC0AE_MS51PC0AE/Library/Device/Include/MS51_32K_IAR.h
__sfr __no_init volatile union
{
  unsigned char SCON_1 ; /* SCON_1  Register */
  struct /* SCON_1  Register */
  {
    unsigned char BIT0 : 1;
    unsigned char BIT1 : 1;
    unsigned char BIT2 : 1;
    unsigned char BIT3 : 1;
    unsigned char BIT4 : 1;
    unsigned char BIT5 : 1;
    unsigned char BIT6 : 1;
    unsigned char BIT7 : 1;
  } SCON_1_bit;
} @ 0xF8;
__sfr __no_init volatile unsigned char PWM0DTEN       @ 0xF9; //TA Protection
__sfr __no_init volatile unsigned char PWM0DTCNT      @ 0xFA; //TA Protection
__sfr __no_init volatile unsigned char PWM0MEN        @ 0xFB;
__sfr __no_init volatile unsigned char PWM0MD         @ 0xFC;
__sfr __no_init volatile unsigned char PORDIS         @ 0xFD;
__sfr __no_init volatile unsigned char EIP1           @ 0xFE;
__sfr __no_init volatile unsigned char EIPH1          @ 0xFF;
   
/*  SFR page 1      */
__sfr __no_init volatile unsigned char P3S            @ 0xAC; 
__sfr __no_init volatile unsigned char P3SR           @ 0xAD; 
                                                        
__sfr __no_init volatile unsigned char P0S            @ 0xB1; 
__sfr __no_init volatile unsigned char P0SR           @ 0xB2; 
__sfr __no_init volatile unsigned char P1S            @ 0xB3; 
__sfr __no_init volatile unsigned char P1SR           @ 0xB4; 
__sfr __no_init volatile unsigned char PWM0INTC       @ 0xB7; 
                                                        
__sfr __no_init volatile unsigned char PWM0C4H        @ 0xC4; 
__sfr __no_init volatile unsigned char PWM0C5H        @ 0xC5; 
__sfr __no_init volatile unsigned char PIOCON1        @ 0xC6; 
                                                        
__sfr __no_init volatile unsigned char PWM0C4L        @ 0xCC; 
__sfr __no_init volatile unsigned char PWM0C5L        @ 0xCD; 
                                                        
__sfr __no_init volatile unsigned char SPCR2          @ 0xF3; 
                                      
__sfr __no_init volatile unsigned char LVRDIS         @ 0xFF; 
                                      
/* MS51_32K SFR BYTE page 2  */       
__sfr __no_init volatile unsigned char ADCBAL         @ 0x84; 
__sfr __no_init volatile unsigned char ADCBAH         @ 0x85; 
__sfr __no_init volatile unsigned char ADCCON3        @ 0x86; 
                                      
__sfr __no_init volatile unsigned char P2M1           @ 0x89; 
__sfr __no_init volatile unsigned char P2M2           @ 0x8A; 
__sfr __no_init volatile unsigned char P2SR           @ 0x8B; 
__sfr __no_init volatile unsigned char P2S            @ 0x8C; 
__sfr __no_init volatile unsigned char ADCSN          @ 0x8D; 
__sfr __no_init volatile unsigned char ADCCN          @ 0x8E; 
__sfr __no_init volatile unsigned char ADCSR          @ 0x8F; 
                                      
__sfr __no_init volatile unsigned char P0UP           @ 0x92; 
__sfr __no_init volatile unsigned char P1UP           @ 0x93; 
__sfr __no_init volatile unsigned char P2UP           @ 0x94; 
__sfr __no_init volatile unsigned char P3UP           @ 0x95; 
__sfr __no_init volatile unsigned char RWKH           @ 0x97; 
                                      
__sfr __no_init volatile unsigned char AINDIDS1       @ 0x99; 
__sfr __no_init volatile unsigned char P0DW           @ 0x9A; 
__sfr __no_init volatile unsigned char P1DW           @ 0x9B; 
__sfr __no_init volatile unsigned char P2DW           @ 0x9C; 
__sfr __no_init volatile unsigned char P3DW           @ 0x9D; 
                                      
__sfr __no_init volatile unsigned char AUXR2          @ 0xA1; 
__sfr __no_init volatile unsigned char AUXR3          @ 0xA2; 
__sfr __no_init volatile unsigned char AUXR4          @ 0xA3; 
__sfr __no_init volatile unsigned char AUXR5          @ 0xA4; 
__sfr __no_init volatile unsigned char AUXR6          @ 0xA5; 
__sfr __no_init volatile unsigned char AUXR7          @ 0xA6; 
__sfr __no_init volatile unsigned char AUXR8          @ 0xA7; 
                                      
__sfr __no_init volatile unsigned char PWM1PH         @ 0xA9; 
__sfr __no_init volatile unsigned char PWM1C0H        @ 0xAA; 
__sfr __no_init volatile unsigned char PWM1C1H        @ 0xAB; 
__sfr __no_init volatile unsigned char PWM1MD         @ 0xAC; 
__sfr __no_init volatile unsigned char PWM1MEN        @ 0xAD; 
                                      
__sfr __no_init volatile unsigned char PWM1PL         @ 0xB1; 
__sfr __no_init volatile unsigned char PWM1C0L        @ 0xB2; 
__sfr __no_init volatile unsigned char PWM1C1L        @ 0xB3; 
__sfr __no_init volatile unsigned char PWM1CON0       @ 0xB4; 
__sfr __no_init volatile unsigned char PWM1CON1       @ 0xB5; 
__sfr __no_init volatile unsigned char PWM1INTC       @ 0xB6; 
__sfr __no_init volatile unsigned char PIOCON2        @ 0xB7; 
                                      
__sfr __no_init volatile unsigned char PWM2PH         @ 0xB9; 
__sfr __no_init volatile unsigned char PWM2C0H        @ 0xBA; 
__sfr __no_init volatile unsigned char PWM2C1H        @ 0xBB; 
__sfr __no_init volatile unsigned char PWM2MD         @ 0xBC; 
__sfr __no_init volatile unsigned char PWM2MEN        @ 0xBD; 
                                      
__sfr __no_init volatile unsigned char PWM2PL         @ 0xC1; 
__sfr __no_init volatile unsigned char PWM2C0L        @ 0xC2; 
__sfr __no_init volatile unsigned char PWM2C1L        @ 0xC3; 
__sfr __no_init volatile unsigned char PWM2CON0       @ 0xC4; 
__sfr __no_init volatile unsigned char PWM2CON1       @ 0xC5; 
__sfr __no_init volatile unsigned char PWM2INTC       @ 0xC6; 
                                      
__sfr __no_init volatile unsigned char PWM3PH         @ 0xC9; 
__sfr __no_init volatile unsigned char PWM3C0H        @ 0xCA; 
__sfr __no_init volatile unsigned char PWM3C1H        @ 0xCB; 
__sfr __no_init volatile unsigned char PWM3MD         @ 0xCC; 
__sfr __no_init volatile unsigned char PWM3MEN        @ 0xCD; 
__sfr __no_init volatile unsigned char EIP2           @ 0xCE; 
__sfr __no_init volatile unsigned char EIPH2          @ 0xCF; 
                                      
__sfr __no_init volatile unsigned char PWM3PL         @ 0xD1; 
__sfr __no_init volatile unsigned char PWM3C0L        @ 0xD2; 
__sfr __no_init volatile unsigned char PWM3C1L        @ 0xD3; 
__sfr __no_init volatile unsigned char PWM3CON0       @ 0xD4; 
__sfr __no_init volatile unsigned char PWM3CON1       @ 0xD5; 
__sfr __no_init volatile unsigned char PWM3INTC       @ 0xD6; 
__sfr __no_init volatile unsigned char XTLCON         @ 0xD7; 
                                      
__sfr __no_init volatile unsigned char SC0DR          @ 0xD9; 
__sfr __no_init volatile unsigned char SC0EGT         @ 0xDA; 
__sfr __no_init volatile unsigned char SC0ETURD0      @ 0xDB; 
__sfr __no_init volatile unsigned char SC0ETURD1      @ 0xDC; 
__sfr __no_init volatile unsigned char SC0IE          @ 0xDD; 
__sfr __no_init volatile unsigned char SC0IS          @ 0xDE; 
__sfr __no_init volatile unsigned char SC0TSR         @ 0xDF; 
                                      
