OpenNuvoton/MS51BSP_IAR/MS51FC0AE_MS51XC0BE_MS51EB0AE_MS51EC0AE_MS51TC0AE_MS51PC0AE/Library/Device/Include/MS51_32K_IAR.h
__sfr __no_init volatile unsigned char SC1DR          @ 0xE1; 
__sfr __no_init volatile unsigned char SC1EGT         @ 0xE2; 
__sfr __no_init volatile unsigned char SC1ETURD0      @ 0xE3; 
__sfr __no_init volatile unsigned char SC1ETURD1      @ 0xE4; 
__sfr __no_init volatile unsigned char SC1IE          @ 0xE5; 
__sfr __no_init volatile unsigned char SC1IS          @ 0xE6; 
__sfr __no_init volatile unsigned char SC1TSR         @ 0xE7; 
                                      
__sfr __no_init volatile unsigned char SC2DR          @ 0xE9; 
__sfr __no_init volatile unsigned char SC2EGT         @ 0xEA; 
__sfr __no_init volatile unsigned char SC2ETURD0      @ 0xEB; 
__sfr __no_init volatile unsigned char SC2ETURD1      @ 0xEC; 
__sfr __no_init volatile unsigned char SC2IE          @ 0xED; 
__sfr __no_init volatile unsigned char SC2IS          @ 0xEE; 
__sfr __no_init volatile unsigned char SC2TSR         @ 0xEF; 
                                      
__sfr __no_init volatile unsigned char SC0CR0         @ 0xF1; 
__sfr __no_init volatile unsigned char SC0CR1         @ 0xF2; 
__sfr __no_init volatile unsigned char SC1CR0         @ 0xF3; 
__sfr __no_init volatile unsigned char SC1CR1         @ 0xF4; 
__sfr __no_init volatile unsigned char SC2CR0         @ 0xF5; 
__sfr __no_init volatile unsigned char SC2CR1         @ 0xF6; 
__sfr __no_init volatile unsigned char PIPS7          @ 0xF7; 
                                      
__sfr __no_init volatile unsigned char PIPS0          @ 0xF9; 
__sfr __no_init volatile unsigned char PIPS1          @ 0xFA; 
__sfr __no_init volatile unsigned char PIPS2          @ 0xFB; 
__sfr __no_init volatile unsigned char PIPS3          @ 0xFC; 
__sfr __no_init volatile unsigned char PIPS4          @ 0xFD; 
__sfr __no_init volatile unsigned char PIPS5          @ 0xFE; 
__sfr __no_init volatile unsigned char PIPS6          @ 0xFF; 



/*  BIT Registers  */
/*  P0  */
#define P07         P0_bit.BIT7
#define P06         P0_bit.BIT6
#define P05         P0_bit.BIT5
#define P04         P0_bit.BIT4
#define P03         P0_bit.BIT3
#define P02         P0_bit.BIT2
#define P01         P0_bit.BIT1
#define P00         P0_bit.BIT0

/*  TCON  */
#define TF1         TCON_bit.BIT7
#define TR1         TCON_bit.BIT6
#define TF0         TCON_bit.BIT5
#define TR0         TCON_bit.BIT4
#define IE1         TCON_bit.BIT3
#define IT1         TCON_bit.BIT2
#define IE0         TCON_bit.BIT1
#define IT0         TCON_bit.BIT0
                    
/*  P1  */
#define P17         P1_bit.BIT7
#define P16         P1_bit.BIT6
#define P15         P1_bit.BIT5
#define P14         P1_bit.BIT4
#define P13         P1_bit.BIT3
#define P12         P1_bit.BIT2
#define P11         P1_bit.BIT1
#define P10         P1_bit.BIT0

/*  SCON  */
#define SM0         SCON_bit.BIT7 
#define FE          SCON_bit.BIT7 
#define SM1         SCON_bit.BIT6 
#define SM2         SCON_bit.BIT5 
#define REN         SCON_bit.BIT4 
#define TB8         SCON_bit.BIT3 
#define RB8         SCON_bit.BIT2 
#define TI          SCON_bit.BIT1 
#define RI          SCON_bit.BIT0 

/*  P2  */ 
#define P20         P2_bit.BIT0

/*  IE  */
#define EA          IE_bit.BIT7
#define EADC        IE_bit.BIT6
#define EBOD        IE_bit.BIT5
#define ES          IE_bit.BIT4
#define ET1         IE_bit.BIT3
#define EX1         IE_bit.BIT2
#define ET0         IE_bit.BIT1
#define EX0         IE_bit.BIT0

/*  P3  */  
#define P30	    P3_bit.BIT0
#define P31	    P3_bit.BIT1
#define P32	    P3_bit.BIT2
#define P33	    P3_bit.BIT3
#define P34	    P3_bit.BIT4
#define P35	    P3_bit.BIT5
#define P36	    P3_bit.BIT6
#define P37	    P3_bit.BIT7
/*  IP  */
#define PADC        IP_bit.BIT6
#define PBOD        IP_bit.BIT5
#define PS          IP_bit.BIT4
#define PT1         IP_bit.BIT3
#define PX1         IP_bit.BIT2
#define PT0         IP_bit.BIT1
#define PX0         IP_bit.BIT0

/*  I2CON  */
#define I2CEN       I2CON_bit.BIT6
#define STA         I2CON_bit.BIT5
#define STO         I2CON_bit.BIT4
#define SI          I2CON_bit.BIT3
#define AA          I2CON_bit.BIT2
#define I2CPX	    I2CON_bit.BIT0

/*  T2CON  */
#define TF2         T2CON_bit.BIT7
#define TR2         T2CON_bit.BIT2
#define CM_RL2      T2CON_bit.BIT0

/*  PSW */
#define CY          PSW.BIT7
#define AC          PSW.BIT6
#define F0          PSW.BIT5
#define RS1         PSW.BIT4
#define RS0         PSW.BIT3
#define OV          PSW.BIT2
#define P           PSW.BIT0

/*  PWMCON0  */
#define PWMRUN      PWMCON0_bit.BIT7
#define LOAD        PWMCON0_bit.BIT6
#define PWMF        PWMCON0_bit.BIT5
#define CLRPWM      PWMCON0_bit.BIT4

/*  ADCCON0  */
#define ADCF        ADCCON0_bit.BIT7
#define ADCS        ADCCON0_bit.BIT6
#define ETGSEL1     ADCCON0_bit.BIT5
#define ETGSEL0     ADCCON0_bit.BIT4
#define ADCHS3      ADCCON0_bit.BIT3
#define ADCHS2      ADCCON0_bit.BIT2
#define ADCHS1      ADCCON0_bit.BIT1
#define ADCHS0      ADCCON0_bit.BIT0

/*  SCON_1  */
#define SM0_1       SCON_1_bit.BIT7
#define FE_1        SCON_1_bit.BIT7 
#define SM1_1       SCON_1_bit.BIT6 
#define SM2_1       SCON_1_bit.BIT5 
#define REN_1       SCON_1_bit.BIT4 
#define TB8_1       SCON_1_bit.BIT3 
#define RB8_1       SCON_1_bit.BIT2 
#define TI_1        SCON_1_bit.BIT1 
#define RI_1        SCON_1_bit.BIT0















